server/backend/app/controllers/poi_api_controller.rb

SELECT  `poi`.* FROM `poi`  WHERE `poi`.`name` = 'Home' AND `poi`.`latitude` = 37.420827 AND `poi`.`longitude` = -121.900224 AND `poi`.`altitude` = 20  ORDER BY `poi`.`id` ASC LIMIT 1
SELECT *, get_distance(latitude, longitude, 37.420827, -121.900224) as distance FROM `poi`  WHERE (get_distance(latitude, longtiude, 37.420827, -121.900224) < 0.25)  ORDER BY distance asc
SELECT COUNT(*) FROM `poi`  WHERE `poi`.`name` = 'Home' AND `poi`.`latitude` = 37.420827 AND `poi`.`longitude` = -121.900224 AND `poi`.`altitude` = 20
UPDATE `poi` SET `number` = 1 WHERE `poi`.`id` = 2
INSERT INTO `poi` (`altitude`, `latitude`, `longitude`, `name`) VALUES (20.0, 37.420827, -121.900224, 'Home')
---
	def create

		for header in request.headers
			puts(header)
		end
		ip = request.headers['IP']
		user = params[:user]

		if is_spam(ip)
			message = {}
			message['status'] = 'failure'
			render :json => JSON.pretty_generate([message])
			return
		end

		poi_list = JSON.parse(request.body.read)

		for poi in poi_list
			name = poi['name']
			lat = poi['latitude']
			long = poi['longitude']
			altitude = poi['altitude']

			if RequestHistory.is_similar_location(ip, lat, long)
				puts('Is similar ' + name)
				next
			else
				puts('Is NOT similar ' + name)
			end

			results = Poi.where(name: name, latitude: lat, longitude: long, altitude: altitude)
			if results.count() > 0
				result = results.first
				Poi.update(result['id'], number: result['number'] + 1)
			else
				Poi.create(name: name, latitude: lat, longitude: long, altitude: altitude)

INSERT INTO `poi_raw` (`altitude`, `ip`, `latitude`, `longitude`, `name`, `time_uploaded`) VALUES (20.0, '127.0.0.1', 37.420827, -121.900224, 'Home', '2014-11-25 07:38:20')
---

			# for keeping track of stuff, if we ever need to access the raw data instead of the condensed version
			# commented out for now to avoid spamming my server
			PoiRaw.create(name: name, latitude: lat, longitude: long, altitude: altitude, time_uploaded: Time.now, ip: ip)