server/backend/app/controllers/poi_api_controller.rb

	def index
		lat = params[:latitude].to_f
		long = params[:longitude].to_f
		f = MyMath.to_radians(123)

		nearby_locations = Poi.select('*, get_distance(latitude, longitude, %f, %f) as distance' % [Poi.sanitize(lat), Poi.sanitize(long)])
			.where('get_distance(latitude, longitude, ?, ?) < ?', lat, long, @@MIN_DISTANCE)
			.limit(@@POI_RESULT_LIMIT)
			.order('distance')
		location_list = []
		nearby_locations.each do |row|
---
SELECT  *, get_distance(latitude, longitude, 37.420754, -121.900224) as distance FROM `poi`  WHERE (get_distance(latitude, longitude, 37.420754, -121.900224) < 200)  ORDER BY distance asc LIMIT 10
SELECT  `poi`.* FROM `poi`  WHERE (get_distance(latitude, longitude, 37.420754, -121.900224) < 200)  ORDER BY get_distance(latitude, longitude, ?, ?), 37.420754, -121.900224 LIMIT 10